app/views/assignments/show.html.erb

	  <strong>Submissions:<strong></br></br>
		  <% @assignment.submissions.each do |submission| %>
---
SELECT "submissions".* FROM "submissions"  WHERE "submissions"."assignment_id" = ?  [["assignment_id", 2]]