app/views/courses/show.html.erb

  <% if @course.students %>
    <% @course.students.each do |student| %>
---
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 1]]

<% if @course.assignments %>
	<% @course.assignments.each do |assignment| %>
---
SELECT "assignments".* FROM "assignments"  WHERE "assignments"."course_id" = ?  [["course_id", 1]]