app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def create
    @assignment = Assignment.new(assignment_params)
    @assignment.course_id = params[:course_id]
    respond_to do |format|
      if @assignment.save
        document_params = ActionController::Parameters.new(params[:assignment][:document]);
        document_params.permit!
        @document = Document.new(document_params)
        @document.attachable_type = 'Assignment'
        @document.attachable_id = @assignment.id
        @document.save
---
INSERT INTO "assignments" ("course_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["created_at", "2014-07-17 16:12:48.761903"], ["title", "Another assignment"], ["updated_at", "2014-07-17 16:12:48.761903"]]
INSERT INTO "documents" ("attachable_id", "attachable_type", "created_at", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @assignment.update(assignment_params)
---
UPDATE "assignments" SET "title" = ?, "updated_at" = ? WHERE "assignments"."id" = 5  [["title", "Bad title!"], ["updated_at", "2014-07-23 13:49:38.186107"]]

  def destroy
    @assignment.destroy
---
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]

    def set_assignment
      @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments"  WHERE "assignments"."id" = ? LIMIT 1  [["id", 19]]