app/controllers/submissions_controller.rb

  def index
    @submissions = Submission.all
---
SELECT "submissions".* FROM "submissions"

  def create
    @submission = Submission.new(submission_params)
    @submission.assignment_id = params[:assignment_id]
    @submission.student_id = current_user.id
    respond_to do |format|
      if @submission.save
        document_params = ActionController::Parameters.new(params[:submission][:document]);
        document_params.permit!
        @document = Document.new(document_params)
        @document.attachable_type = 'Submission'
        @document.attachable_id = @submission.id
        @document.save
---
INSERT INTO "submissions" ("assignment_id", "created_at", "student_id", "updated_at") VALUES (?, ?, ?, ?)  [["assignment_id", 2], ["created_at", "2014-07-23 15:36:25.511875"], ["student_id", 4], ["updated_at", "2014-07-23 15:36:25.511875"]]
INSERT INTO "documents" ("attachable_id", "attachable_type", "created_at", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @submission.update(submission_params)
---
UPDATE "submissions" SET "grade" = ?, "score" = ?, "updated_at" = ? WHERE "submissions"."id" = 2  [["grade", "B"], ["score", 100], ["updated_at", "2014-07-23 16:13:38.775015"]]

    def set_submission
      @submission = Submission.find(params[:id])
---
SELECT  "submissions".* FROM "submissions"  WHERE "submissions"."id" = ? LIMIT 1  [["id", 2]]